---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceCutout
source: html/899813d4-994f-c049-7efa-6460778a554c.htm
---
# Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceCutout Property

The property labeled "Image" from the "AdvancedGlazing" schema.

## Syntax (C#)
```csharp
public static string SurfaceCutout { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.